Revit 2027 API
SymbolTypeId.Kcal Property
 Symbol kcal, indicating unit Kilocalories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Kcal { get; }
Public Shared ReadOnly Property Kcal As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Kcal {
	ForgeTypeId^ get ();
}
static member Kcal : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace